ksekimoto/netmf-interpreter/DeviceCode/Targets/Native/RX63N/DeviceCode/RX63N_USB/RX63N_usb_functions.cpp
void Pipe_Config(void)
{
    USB_CONTROLLER_STATE *State = &g_USB_ControllerState;
    const USB_ENDPOINT_DESCRIPTOR *pep = (USB_ENDPOINT_DESCRIPTOR *)NULL;
    const USB_INTERFACE_DESCRIPTOR *pif  = (USB_INTERFACE_DESCRIPTOR *)NULL;
    while (USB_NextEndpoint(State, pep, pif)) {
        UINT32 endpoint = pep->bEndpointAddress & 0x7F;
        UINT32 dir = (pep->bEndpointAddress & 0x80)? 1:0;
        RX_USB_EP_Initialize((UINT32)USB_Pipe[endpoint],
                (UINT32)endpoint, (UINT32)dir, pep->bmAttributes, pep->wMaxPacketSize);
        USB_DEBUG4("E%d:P%d:D%d\r\n", endpoint, USB_Pipe[endpoint], dir);
    }
}

void RX_USB_EP_Reset(void)
{
    USB_DEBUG1("Ep\r\n");
    UINT32 i;
    INT32 pipeno;
    for (i = 0; i < USB_MAX_EP; i++) {
        pipeno = USB_Pipe[i];
        if (pipeno >= 0)
            USB_Stall_Clear((UINT32)pipeno);
    }
}

void RX_USB_Reset(void)
{
    USB_DEBUG1("Rt\r\n");
    UINT32 i;
    INT32 pipeno;
    Pipe_Config();
    RX_USB_EP_Reset();
    RX_USB_Interrupt_Initialize();
}

void Pipe_Read(UINT32 pipe, volatile UINT8 *buf, UINT32 size, volatile UINT32 *count)
{
    UINT8 dummy;
    UINT32 len;
    UINT8 type = USB_FifoType[pipe];
    GLOBAL_LOCK(irq);
    PipeSetFIFO((UINT16)pipe, DIR_OUT, MBW_BYTE);
    volatile UINT16 *pfifosel = (volatile UINT16 *)pFIFOSEL[type];
    volatile UINT16 *pfifoctr = (volatile UINT16 *)pFIFOCTR[type];
    volatile UINT8 *pfifo = (volatile UINT8 *)pFIFO[type];
    *pfifosel |= 0x8000;                // RCNT = 1
    len = *pfifoctr & 0x01FF;           // DTLN
    if (len == 0) {
        *pfifoctr |= 0x4000;            // BCLR = 1
    }
    if (buf != NULL) {
        while ((len!= 0) && (size > *count)) {
            *buf++ = *pfifo;
            (*count)++;
            len--;
        }
    }
    SetPipePidNAK(pipe);
    if ((*count == 0) && (0 != (*pfifoctr & 0x01FF))) {
        lcd_printf("fr error\r\n");
        while (0 != (*pfifoctr & 0x01FF)) {
            dummy = *pfifo;
        }
    }
    USB_DEBUG3("Pr%d:%d\r\n", pipe, *count);
}

void Pipe_Write(UINT32 pipe, volatile UINT8 *buf, UINT32 size, volatile UINT32 len)
{
    USB_DEBUG3("Pw%d:%d\r\n", pipe, len);
    GLOBAL_LOCK(irq);
    PipeSetFIFO((UINT16)pipe, DIR_IN, MBW_BYTE);
    UINT32 count = 0;
    UINT8 type = USB_FifoType[pipe];
    volatile UINT16 *pfifoctr = (volatile UINT16 *)pFIFOCTR[type];
    volatile UINT8 *pfifo = (volatile UINT8 *)pFIFO[type];
    if (buf != NULL)
        while ((len != 0) && (size > count)) {
            *pfifo = (UINT8)*buf;
            buf++;
            count++;
            len--;
        }
    if (count != size) {
        *pfifoctr |= 0x8000;            // BVAL = 1
    }
    SetPipePidBUF(pipe);
    usb_int_brdy_disable(pipe); // disable interrupt
    usb_int_bemp_enable(pipe);  // enable interrupt
    usb_int_nrdy_enable(pipe);  // enable interrupt
}

void HandleSetupCmd(void)
{
    USB_CONTROLLER_STATE *State = &g_USB_ControllerState;
    USB0.INTSTS0.BIT.VALID = 0;
    UINT16 *buf = (UINT16 *)&USB_EP0Buffer[0];
    *buf++ = USB0.USBREQ.WORD;
    *buf++ = USB0.USBVAL;
    *buf++ = USB0.USBINDX;
    *buf = USB0.USBLENG;
    State->Data = (UINT8 *)&USB_EP0Buffer[0];
    State->DataSize = (UINT8)8;
    UINT8 result = USB_ControlCallback(State);
    
    switch (result) {
    case USB_STATE_DATA:
        break;
    case USB_STATE_ADDRESS:
        /* upper layer needs us to change the address */
        // address change delayed to end of reply packet
        break;
    case USB_STATE_DONE:
        USB_DEBUG1("Sd\r\n");
        State->DataCallback = NULL;
        break;
    case USB_STATE_STALL:
        USB_DEBUG1("Ss\r\n");
        return;
    case USB_STATE_STATUS:
        USB_DEBUG1("St\r\n");
        break;
    case USB_STATE_CONFIGURATION:
        USB_DEBUG1("Sc\r\n");
        break;
    case USB_STATE_REMOTE_WAKEUP:
        USB_DEBUG1("Sw\r\n");
        break;
    default:
        break;
    }
    if (result != USB_STATE_STALL) {
    if (State->DataCallback != NULL) {
        State->DataCallback(State);
        if (State->DataSize != 0) {
                //USB_DEBUG1("Si");
                Pipe_Write(0, (UINT8 *)State->Data, (UINT32)MAX_EP0_SIZE, (UINT32)State->DataSize);
            } else {
                //USB_DEBUG1("S0");
                USB_Control_Status();
            }
        }
    }
}

void HandleVBus(void)
{
    USB_DEBUG1("V");
    UINT16 vbsts_value;
    UINT8 count;
    #define CHATTER_COUNT 5
    do {
        count = CHATTER_COUNT;
        vbsts_value = USB0.INTSTS0.BIT.VBSTS;
        while (count != 0) {
            if (USB0.INTSTS0.BIT.VBSTS != vbsts_value) {
                break;
            } else {
                count--;
            }
        }
    } while (count != 0);
    if (0 != vbsts_value) { // connected;
        RX_USB_Reset();
    } else {                // disconnected;
        RX_USB_Reset();
    }
}

void HandleDVST(void)
{
    switch(USB0.INTSTS0.BIT.DVSQ)
    {
        case 0:         // Powered State
            USB_DEBUG1("D0\r\n");
            break;
        case 1:         // Default State
            USB_DEBUG1("D1\r\n");
            if (USB0.DVSTCTR0.BIT.RHST == 4) {  // BUS RESET
                RX_USB_EP_Reset();
            }
            break;
        case 2:         // Address State
            USB_DEBUG1("D2\r\n");
            break;
        case 3:         // Configured State
            USB_DEBUG1("D3\r\n");
            RX_USB_EP_Reset();
#ifdef USB_DUMP_PID
            dump_pid(1);
            dump_pid(2);
#endif
            break;
        case 4:
        default:        // Suspended State
            USB_DEBUG1("D4\r\n");
            break;
    };
}

void HandleCTRT(void)
{
    switch(USB0.INTSTS0.BIT.CTSQ)
    {
        case 0:         // IDLE or Setup
            USB_DEBUG1("C0\r\n");
            break;
        case 1:         // Control Read Data
            USB_DEBUG1("C1");
            HandleSetupCmd();
            break;
        case 2:         // Control Read Status
            USB_DEBUG1("C2");
            break;
        case 3:         // Control Write Data
            USB_DEBUG1("C3");
            HandleSetupCmd();
            break;
        case 4:         // Control Write Status
            USB_DEBUG1("C4");
            break;
        case 5:         // Control Write(no data) Status
            USB_DEBUG1("C5");
            HandleSetupCmd();
        break;
        case 6:         // Control Transfer Error
            USB_DEBUG1("C6");
        break;
        default:        // INVALID
            USB_DEBUG1("C7");
        break;
    };
}

void RX_USB_Send(USB_CONTROLLER_STATE *State, UINT32 endpoint)
{
    GLOBAL_LOCK(irq);
    USB_PACKET64* Packet64 = USB_TxDequeue(State, endpoint, TRUE);
    UINT32 pipeno = USB_Pipe[endpoint];
    const USB_ENDPOINT_DESCRIPTOR *pep = USB_EPDesc[endpoint];
    if (Packet64) {
        Pipe_Write(pipeno, (UINT8 *)Packet64->Buffer, pep->wMaxPacketSize, (UINT32)Packet64->Size);
        USB_DEBUG3("Us%d:%d\r\n", pipeno, Packet64->Size);
#ifdef USB_USE_TXZERO_INT
        if (pep->wMaxPacketSize == Packet64->Size)
            USB_Zero = 1;
#endif
    } else {
        //USB_Zero = 2;
        //Pipe_Write(pipeno, 0, pep->wMaxPacketSize, 0);
        USB_DEBUG2("Us%d:0\r\n", pipeno);
    }
}

