ksekimoto/netmf-interpreter/DeviceCode/Targets/Native/RX63N/DeviceCode/RX63N_USB/RX63N_usb_functions.cpp
void RX_USB_Receive(USB_CONTROLLER_STATE *State, UINT32 endpoint)
{
    GLOBAL_LOCK(irq);
    BOOL full;
    UINT32 pipeno = USB_Pipe[endpoint];
    USB_PACKET64* Packet64 = USB_RxEnqueue(State, endpoint, full);
    if (Packet64) {
        const USB_ENDPOINT_DESCRIPTOR *pep = USB_EPDesc[endpoint];
        UINT32 size = 0;
        Pipe_Read(pipeno, (UINT8 *)Packet64->Buffer, pep->wMaxPacketSize, &size);
        Packet64->Size = (UINT8)size;
            USB_DEBUG3("Ur%d:%d\r\n", pipeno, Packet64->Size);
        usb_int_brdy_disable(pipeno);
    } else {
        USB_DEBUG2("Ur%d:0\r\n", pipeno);
        //usb_int_brdy_disable(pipeno);
    }

}

// BEMP Interrupt Handler
// TX: when TX completion
// RX: when receiving data > MaxPackectSize
void HandleBEMP(void)
{
    GLOBAL_LOCK(irq);
    USB_CONTROLLER_STATE *State = &g_USB_ControllerState;
    UINT16 bempsts = USB0.BEMPSTS.WORD;
    UINT16 bempenb = USB0.BEMPENB.WORD;
    if (1 == USB0.BEMPSTS.BIT.PIPE0BEMP) {
        USB_DEBUG1("e0");
        USB0.BEMPSTS.WORD = ~0x0001;
        if (State->DataCallback != NULL) {
            State->DataCallback(State);
            if (State->DataSize != 0) {
                Pipe_Write(0, (UINT8 *)State->Data, (UINT32)MAX_EP0_SIZE, (UINT32)State->DataSize);
            } else {
                USB_Control_Status();
            }
        } else {
            USB_Control_Status();
        }
    } else {
        USB0.BEMPSTS.WORD = ~bempsts;
        for (UINT32 endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
            INT8 pipeno = USB_Pipe[endpoint];
            if (pipeno >= 0) {
                UINT16 mask = (1 << pipeno);
                if ((bempsts & mask) && (bempenb & mask)) {
                    USB_DEBUG2("BE%d\r\n", pipeno);
                    UINT16 pid = GetPipePid(pipeno);
                    if ((pid == PID_STALL_1) || (pid == PID_STALL_2)) {
                        USB_DEBUG3("Ss%d:%d\r\n", pipeno, pid);
                    } else {
                        if (Pipe_Inbuf(pipeno) == 0) {
                            usb_int_bemp_disable(pipeno);
                            SetPipePidNAK(pipeno);
#ifdef USB_USE_TXZERO_INT
                            if (RX64M_USB_Zero == 1) {
                                USB_DEBUG1("Zp\r\n");
                                Pipe_Write(pipeno, 0, 64, 0);
                                RX64M_USB_Zero = 2;
                            }
#endif
                        }
                    }
                }
            }
        }
    }
}

void HandleNRDY(void)
{
    GLOBAL_LOCK(irq);
    UINT16 nrdysts = USB0.NRDYSTS.WORD;
    UINT16 nrdyenb = USB0.NRDYENB.WORD;
    USB0.NRDYSTS.WORD = ~nrdysts;
    if ((USB0.NRDYSTS.BIT.PIPE0NRDY == 1)
            && (USB0.NRDYENB.BIT.PIPE0NRDYE == 1)) {
        USB_DEBUG1("n0");
        USB0.NRDYSTS.WORD = ~0x0001;
    } else {
        for (UINT32 endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
            INT8 pipeno = USB_Pipe[endpoint];
            if (pipeno >= 0) {
                UINT16 mask = (1 << pipeno);
                if ((nrdysts & mask) && (nrdyenb & mask)) {
                    USB0.NRDYSTS.WORD = ~mask;
                    USB_DEBUG2("NR%d\r\n", pipeno);
#ifdef USB_USE_TXZERO_INT
                    if (RX64M_USB_Zero == 2) {
                        RX64M_USB_Zero = 0;
                    } else {
                        SetPipePidBUF(pipeno);
                    }
#endif
                    usb_int_nrdy_disable(pipeno);
                }
            }
        }
    }
}

void HandleBRDY(void)
{
    UINT16 brdysts = USB0.BRDYSTS.WORD;
    UINT16 brdyenb = USB0.BRDYENB.WORD;
    USB_CONTROLLER_STATE *State = &g_USB_ControllerState;

    if ((USB0.BRDYSTS.BIT.PIPE0BRDY == 1)
            && (USB0.BRDYENB.BIT.PIPE0BRDYE == 1)) {
        USB0.BRDYSTS.WORD = ~0x0001;
        if (USB0.DCPCFG.BIT.DIR == 0) {
        UINT32 size = 0;
            State->Data = (UINT8 *)&USB_EP0Buffer[0];
            Pipe_Read(0, (UINT8 *)State->Data, MAX_EP0_SIZE, &size);
        State->DataSize = (UINT8) size;
        }
        USB_DEBUG2("BR0:%d\r\n", USB0.DCPCFG.BIT.DIR);
    } else {
        for (UINT32 endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
            INT8 pipeno = USB_Pipe[endpoint];
            if (pipeno >= 0) {
                UINT16 mask = (1 << pipeno);
                if ((brdysts & mask) && (brdyenb & mask)) {
                    USB0.BRDYSTS.WORD = ~mask;
                    USB0.PIPESEL.BIT.PIPESEL = pipeno;
                    USB_DEBUG3("BR%d:%d\r\n", pipeno, USB0.PIPECFG.BIT.DIR);
                    if (USB0.PIPECFG.BIT.DIR == 0) {
                        RX_USB_Receive(State, endpoint);  // OUT
                    } else {
                        RX_USB_Send(State, endpoint);     // IN
                    }
                }
            }
        }
    }
 }

static void USBInterruptHandler(void)
{
    if (1 == USB0.INTSTS0.BIT.VBINT) {
        USB0.INTSTS0.BIT.VBINT = 0;
        HandleVBus();
    } else
    if (1 == USB0.INTSTS0.BIT.DVST) {
        USB0.INTSTS0.BIT.DVST = 0;
        HandleDVST();
    } else
    if (1 == USB0.INTSTS0.BIT.CTRT) {
        HandleCTRT();
        USB0.INTSTS0.BIT.CTRT = 0;
    } else
    if (1 == USB0.INTSTS0.BIT.BEMP) {
        HandleBEMP();
    } else
    if (1 == USB0.INTSTS0.BIT.NRDY) {
        HandleNRDY();
    } else
    if (1 == USB0.INTSTS0.BIT.BRDY) {
        HandleBRDY();
    }
}

USB_CONTROLLER_STATE * CPU_USB_GetState(int Controller)
{
    if (Controller != 0)
        return NULL;
    return (USB_CONTROLLER_STATE *)&g_USB_ControllerState;
}

// CPU_USB_Initialize Function
//  Initializes the client module at the driver layer.
HRESULT CPU_USB_Initialize(int Controller)
{
#if defined(DEBUG_USB)
    DebuggerPort_Initialize(COM1);
#endif
    GLOBAL_LOCK(irq);
    USB_CONTROLLER_STATE *State = &g_USB_ControllerState;
    if (Controller != 0) return S_FALSE;
#ifdef RENESAS_FW
    USB_Init();
#endif
    RX_USB_HW_Initialize();
    USB_PinsProtected = FALSE;
    CPU_USB_ProtectPins(Controller, TRUE);;
    State->DeviceState = USB_DEVICE_STATE_DETACHED;
    USB_StateCallback(State);
    USB_PinsProtected = TRUE;
    State->EndpointCount = USB_MAX_EP;
    State->EndpointStatus = &USB_EPStatus[0];
    State->PacketSize = MAX_EP0_SIZE;
    UINT32 endpoint;
    for (endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
        State->CurrentPacketOffset[endpoint] = 0;
        State->IsTxQueue[endpoint] = FALSE;
        State->MaxPacketSize[endpoint] = USB_MAX_DATA_PACKET_SIZE;
        USB_Pipe[endpoint] = -1;
    }
    USB_EP_Type = 0;
    USB_Zero = 0;
    pipe_interrupt = PIPE_INT_ST;
    pipe_bulk = PIPE_BULK_ST;
    const USB_ENDPOINT_DESCRIPTOR *pep = (USB_ENDPOINT_DESCRIPTOR *)NULL;
    const USB_INTERFACE_DESCRIPTOR *pif  = (USB_INTERFACE_DESCRIPTOR *)NULL;
    while (USB_NextEndpoint(State, pep, pif)) {
        endpoint = pep->bEndpointAddress & 0x7F;
        UINT8 endpointSize = pep->wMaxPacketSize;
        State->MaxPacketSize[endpoint] = endpointSize;
        QueueBuffers[endpoint-1].Initialize();
        State->Queues[endpoint] = &QueueBuffers[endpoint-1];
        USB_EPDesc[endpoint] = pep;
        switch (pep->bmAttributes) {
        case USB_ENDPOINT_ATTRIBUTE_BULK:
            USB_Pipe[endpoint] = pipe_bulk;
            if (pep->bEndpointAddress & 0x80) {
                RX_USB_EP_Initialize((UINT32)pipe_bulk++,
                        (UINT32)endpoint, (UINT32)1, pep->bmAttributes, endpointSize);
                State->IsTxQueue[endpoint] = TRUE;
            } else {
                RX_USB_EP_Initialize((UINT32)pipe_bulk++,
                        (UINT32)endpoint, (UINT32)0, pep->bmAttributes, endpointSize);
            }
            break;
        case USB_ENDPOINT_ATTRIBUTE_INTERRUPT:
            USB_Pipe[endpoint] = pipe_interrupt;
            if (pep->bEndpointAddress & 0x80) {
                RX_USB_EP_Initialize(pipe_interrupt++,
                        endpoint, 1, pep->bmAttributes, endpointSize);
                State->IsTxQueue[endpoint] = TRUE;
            } else {
                RX_USB_EP_Initialize(pipe_interrupt++,
                        endpoint, 0, pep->bmAttributes, endpointSize);
            }
            break;
        case USB_ENDPOINT_ATTRIBUTE_ISOCHRONOUS:
            // ToDo
        default:
            break;
        }
        USB_EP_Type |= (pep->bmAttributes & 3) << (endpoint * 2);
    }
    if (USB_EP_Type == 0)
        return S_FALSE;
    HAL_Time_Sleep_MicroSeconds(1000);
    RX_USB_Interrupt_Enable();
    CPU_USB_ProtectPins(Controller, FALSE);
    USB_DEBUG1("*I*");
    return S_OK;
}

// CPU_USB_Uninitialize Function
//  Uninitializes (shuts down) USB communications at the driver layer.
HRESULT CPU_USB_Uninitialize(int Controller)
{
    USB_CONTROLLER_STATE *State = &g_USB_ControllerState;
    GLOBAL_LOCK(irq);
    memset(&g_USB_ControllerState, 0, sizeof(g_USB_ControllerState));
    CPU_USB_ProtectPins(Controller, TRUE);
    USB_EP_Type = 0;
    State->DeviceState = USB_DEVICE_STATE_DETACHED;
    RX_USB_Interrupt_Uninitialize();
    USB_DEBUG1("*U*");
    return S_OK;
}

// CPU_USB_StartOutput Function
//  Begins sending output to a specified USB port.
BOOL CPU_USB_StartOutput(USB_CONTROLLER_STATE* State, int endpoint)
{
    //GLOBAL_LOCK(irq);
    if (State == NULL || endpoint >= USB_MAX_EP)
        return FALSE;
    if (State->Queues[endpoint] == NULL || !State->IsTxQueue[endpoint])
        return FALSE;
    if (USB_EPStatus[endpoint] & USB_STATUS_ENDPOINT_HALT) {
        while (USB_TxDequeue(State, endpoint, TRUE) != NULL);  // clear TX queue
        return TRUE;
    }
    UINT32 pipeno = USB_Pipe[endpoint];
    if (Pipe_Inbuf(pipeno) == 0) {
        USB_DEBUG2("So%d\r\n", USB_Pipe[endpoint]);
        SetPipePidNAK(pipeno);
        RX_USB_Send(State, endpoint);
        return TRUE;
    } else
        return FALSE;
}

// CPU_USB_RxEnable Function
//  Enables a specified USB port to receive data.
BOOL CPU_USB_RxEnable(USB_CONTROLLER_STATE* State, int endpoint)
{
    GLOBAL_LOCK(irq);
    UINT32 pipeno = USB_Pipe[endpoint];
    USB_DEBUG2("Re%d\r\n", pipeno);
    SetPipePidBUF(pipeno);
    usb_int_brdy_enable(pipeno);
    return TRUE;
}

// CPU_USB_GetInterruptState Function
//  Determines whether there are currently interrupts pending for the USB port.
BOOL CPU_USB_GetInterruptState()
{
#if 0
    BOOL flag = ((USB0.BEMPENB.WORD & USB0.BEMPSTS.WORD) != 0) || ((USB0.BRDYENB.WORD & USB0.BRDYSTS.WORD) != 0);
    USB_DEBUG2("Is%d\r\n", flag);
    return flag;
#else
    return FALSE;
#endif
}

// Puts USB pins into a known state to prevent spurious inputs.
// Parameters
// On
// A value you can set to true to protect the USB pins; set it to false to disable protection.
// Return Value
// true if the operation succeeded; otherwise, false.
//
// Setting the On parameter to true detaches the USB module from the host.
// This protects the USB pins by stopping all USB communications.
// Setting On to false enables the pins, thus enabling the host to detect the USB client.
// As soon as the USB client is detected, the enumeration process begins.
// USB communications resume when the enumeration process has finished.
BOOL CPU_USB_ProtectPins(int Controller, BOOL On)
{
    USB_CONTROLLER_STATE *State = &g_USB_ControllerState;
    GLOBAL_LOCK(irq);
    if (On == TRUE) {
        if (USB_PinsProtected == FALSE) {
            USB_DEBUG1("+");
            USB_PinsProtected = TRUE;
            RX_USB_Pullup_Disconnect();
            RX_USB_Reset();
            for(int ep = 1; ep < USB_MAX_EP; ep++) {
                if (State->Queues[ep] && State->IsTxQueue[ep]) {
                    while (USB_TxDequeue(State, ep, TRUE) != NULL);
                }
            }
            State->DeviceState = USB_DEVICE_STATE_DETACHED;
            USB_StateCallback(State);
        }
    } else {
        if (USB_PinsProtected == TRUE) {
            USB_DEBUG1("-");
            USB_PinsProtected = FALSE;
            RX_USB_Pullup_Connect();
            RX_USB_Reset();
            State->DeviceState = USB_DEVICE_STATE_ATTACHED;
            USB_StateCallback(State);
        }
    }
    return TRUE;
}

#ifdef __cplusplus
extern "C" {
#endif
void __attribute__ ((interrupt)) INT_Excep_USB0_D0FIFO0(void) { }
void __attribute__ ((interrupt)) INT_Excep_USB0_D1FIFO0(void) { }
void __attribute__ ((interrupt)) INT_Excep_USB0_USBI0(void)
{
    USBInterruptHandler();
}
#ifdef __cplusplus
}
#endif
